[
    {
        "Date": "1 January 2023",
        "Event": "The Baroness Stedman-Scott steps down from the post of Parliamentary Under-Secretary of State for Work and Pensions."
    },
    {
        "Date": "5 January 2023",
        "Event": "The UK government confirms it will not go ahead with a plan to privatise Channel 4."
    },
    {
        "Date": "9 January 2023",
        "Event": "A new scheme to support businesses with the cost of energy bills is outlined in the House of Commons to replace existing support due to end in March 2023. The scheme will replace capped energy bills with a wholesale discount on gas and electricity, and only apply when energy bills are high. Industries such as glass, ceramics and steel, which use a greater amount of energy, will get a larger discount than others."
    },
    {
        "Date": "10 January 2023",
        "Event": "The UK government published the Strikes (Minimum Service Levels) Bill 2023, designed to require public sector organisations to provide a minimum service when their unions vote to strike."
    },
    {
        "Date": "11 January 2023",
        "Event": "Andrew Bridgen, the MP for North West Leicestershire, is suspended from the Conservative Party for spreading misinformation about COVID-19 vaccines after posting a tweet comparing them to The Holocaust."
    },
    {
        "Date": "12 January 2023",
        "Event": "Prime Minister Rishi Sunak and First Minister of Scotland Nicola Sturgeon hold talks at a hotel in Inverness."
    },
    {
        "Date": "13 January 2023",
        "Event": "Former GB News presenter Mercy Muroki has been appointed by the UK government to advise Kemi Badenoch, the Minister for Women and Equalities, on gender policy."
    },
    {
        "Date": "16 January 2023",
        "Event": "The UK government announces it will block the Gender Recognition Reform (Scotland) Bill amid concerns about its impact on UK-wide equality law."
    },
    {
        "Date": "16 January 2023",
        "Event": "MPs vote 309–249 in favour of the Strikes (Minimum Service Levels) Bill, which now moves to the committee stage."
    },
    {
        "Date": "19 January 2023",
        "Event": "Prime Minister Sunak apologises for taking his seat belt off in a moving car to film a social media clip. Lancashire Police later say they are \"looking into\" the incident. He is issued with a fixed-penalty notice the following day."
    },
    {
        "Date": "22 January 2023",
        "Event": "Labour's chairwoman, Anneliese Dodds writes to Daniel Greenberg, the Parliamentary Commissioner for Standards, requesting \"an urgent investigation\" into claims that Richard Sharp, the Chairman of the BBC, helped former Prime Minister Boris Johnson secure a loan guarantee weeks before Johnson recommended him for the BBC chairmanship."
    },
    {
        "Date": "23 January 2023",
        "Event": "William Shawcross, the Commissioner for Public Appointments, is to hold a review into the process of appointing Chairman of the BBC Richard Sharp following claims he helped then-Prime Minister Boris Johnson secure a loan guarantee shortly before his appointment."
    },
    {
        "Date": "23 January 2023",
        "Event": "Prime Minister Sunak orders his Independent Adviser on Ministers' Interests to investigate a disclosure that Conservative Party Chairman Nadhim Zahawi paid a £5m penalty to HM Revenue and Customs for unpaid taxes during his time as Chancellor of the Exchequer."
    },
    {
        "Date": "26 January 2023",
        "Event": "GB News have hired Conservative MP and former Leader of the House of Commons Jacob Rees-Mogg as a presenter."
    },
    {
        "Date": "28 January 2023",
        "Event": "Eric Pickles, chair of the Advisory Committee on Business Appointments, says that Nadine Dorries, the former Secretary of State for Culture, has breached the ministerial code by not consulting the watchdog about her appointment as a presenter on TalkTV, where she is to present a weekly show from 3 February 2023."
    },
    {
        "Date": "29 January 2023",
        "Event": "Nadhim Zahawi is dismissed as Chair of the Conservative Party after an inquiry finds he committed a \"serious breach of the ministerial code\" over his tax affairs."
    },
    {
        "Date": "30 January 2023",
        "Event": "William Shawcross, the commissioner for public appointments, steps back from the planned investigation into how Richard Sharp got the job as BBC chairman because of previous contact between them. Another investigator will be appointed to take on the inquiry."
    },
    {
        "Date": "30 January 2023",
        "Event": "MPs vote 315–246 in favour of the Strikes (Minimum Service Levels) Bill, which is then sent to the House of Lords for further debate."
    },
    {
        "Date": "5 February 2023",
        "Event": "In a move seen as marking her return to political life, former Prime Minister Liz Truss writes an article for The Sunday Telegraph in which she says her economic agenda was never given a \"realistic chance\"."
    },
    {
        "Date": "7 February 2023",
        "Event": "Prime Minister Sunak performs a cabinet reshuffle. Greg Hands is named as the new Conservative Party chairman; Grant Shapps becomes the Secretary of State for Energy, Security and Net Zero in a newly formed department; Kemi Badenoch is appointed as the first Secretary of State at the newly created Department for Business and Trade, with continued responsibility as equalities minister."
    },
    {
        "Date": "8 February 2023",
        "Event": "Ukraine's President Volodymyr Zelensky addresses a joint session of Parliament during his first visit to the UK since Russia invaded his country. He later visits Buckingham Palace for a meeting with the King."
    },
    {
        "Date": "8 February 2023",
        "Event": "Former Labour MP Jared O'Mara, who submitted fake expense claims to fund his cocaine habit, is convicted of fraud. He is sentenced the following day to four years in prison."
    },
    {
        "Date": "9 February 2023",
        "Event": "The Independent Parliamentary Standards Authority confirms that MPs pay will increase by 2.9% from Apr 2023, taking their salary from £84,144 to £86,584."
    },
    {
        "Date": "9 February 2023",
        "Event": "2023 West Lancashire by-election: Labour hold the seat with a 62.3% vote share, and an increase of 10.3%. Ashley Dalton is the new MP."
    },
    {
        "Date": "9 February 2023",
        "Event": "Former Culture secretary Nadine Dorries announces she will step down as an MP at the next general election."
    },
    {
        "Date": "9 February 2023",
        "Event": "In a radio interview before his appointment as Deputy Chairman of the Conservative Party, Lee Anderson said he would support the return of capital punishment where the perpetrators are clearly identifiable. Prime Minister Rishi Sunak said neither he nor the government shared Anderson's stance."
    },
    {
        "Date": "13 February 2023",
        "Event": "Douglas Alexander, a minister in the governments of Tony Blair and Gordon Brown, who lost his seat in the 2015 general election, announces he will stand for parliament again at the next election as Labour's candidate for East Lothian."
    },
    {
        "Date": "15 February 2023",
        "Event": "Nicola Sturgeon announces her resignation as First Minister of Scotland and Leader of the Scottish National Party after eight years in the role; she will stay on until her successor has been elected."
    },
    {
        "Date": "15 February 2023",
        "Event": "Jeremy Corbyn will not stand as a Labour MP at the next general election, the party's leader, Sir Keir Starmer, confirms."
    },
    {
        "Date": "16 February 2023",
        "Event": "Deputy First Minister of Scotland John Swinney rules himself out of the SNP leadership contest."
    },
    {
        "Date": "19 February 2023",
        "Event": "Former Prime Minister Boris Johnson urges present Prime Minister Rishi Sunak not to scrap the Northern Ireland Protocol Bill, warning to do so would be a \"great mistake\"."
    },
    {
        "Date": "19 February 2023",
        "Event": "Scottish Health Secretary Humza Yousaf and former Minister for Community Safety Ash Regan become the first two candidates to announce they will stand in the Scottish National Party leadership election. Keith Brown, the SNP's depute leader, Neil Gray, the Minister for International Development, and Màiri McAllan, the Environment Minister, all rule themselves out of the contest."
    },
    {
        "Date": "19 February 2023",
        "Event": "In a speech to the Scottish Labour Party conference in Edinburgh, Labour leader Sir Keir Starmer rules out a deal with the SNP \"under any circumstances\", and warns against complacency following the departure of Nicola Sturgeon as SNP leader and First Minister."
    },
    {
        "Date": "20 February 2023",
        "Event": "Scotland's Finance Secretary, Kate Forbes, announces she is running in the Scottish National Party leadership election."
    },
    {
        "Date": "21 February 2023",
        "Event": "The UK Government announces that it had a budget surplus in Jan, with £5bn more in revenue than predicted."
    },
    {
        "Date": "21 February 2023",
        "Event": "Kate Forbes insists her campaign to become the next SNP leader has not been derailed after she lost the support of several colleagues following comments about same-sex marriage and having children outside marriage, both of which she is opposed to as a member of the Free Church of Scotland."
    },
    {
        "Date": "21 February 2023",
        "Event": "MSPs vote 68–57 to approve the Scottish Government's budget for the 2023–24 financial year, which includes a tax rise for everyone in Scotland earning more than £43,662."
    },
    {
        "Date": "23 February 2023",
        "Event": "Labour leader Sir Keir Starmer outlines the five key issues that his party will focus on during the run up to the next general election: higher economic growth, clean energy, improving the NHS, reforming the justice system, and raising education standards."
    },
    {
        "Date": "23 February 2023",
        "Event": "Environment Secretary Therese Coffey, commenting on the vegetable shortage, tells MPs \"we anticipate the situation will last about another two to four weeks\"."
    },
    {
        "Date": "24 February 2023",
        "Event": "Nominations close for the SNP leadership election, with Kate Forbes, Ash Regan and Humza Yousaf having all reached the threshold of supporters to go forward into the contest."
    },
    {
        "Date": "25 February 2023",
        "Event": "Theo Clarke, the Conservative MP for Stafford, is deselected by her constituency party a week after returning to Parliament from maternity leave."
    },
    {
        "Date": "26 February 2023",
        "Event": "Luciana Berger, who left the Labour Party in 2019 following the antisemitism controversy, is to re-join the party after accepting an apology from Sir Keir Starmer, who said there had been a \"litany of failures\"."
    },
    {
        "Date": "26 February 2023",
        "Event": "Betty Boothroyd, who became the first female Speaker of the House of Commons in 1992, dies at the age of 93."
    },
    {
        "Date": "27 February 2023",
        "Event": "Sunak, and President of the European Commission, Ursula von der Leyen, announce a new Brexit deal for Northern Ireland, named the Windsor Framework."
    },
    {
        "Date": "1 March 2023",
        "Event": "COVID-19 in the UK: WhatsApp messages leaked to the Daily Telegraph are reported as suggesting former Health Secretary Matt Hancock chose to ignore advise from experts in Apr 2020 that there should be \"testing of all going into care homes\". A spokesman for Hancock said \"These stolen messages have been doctored to create a false story that Matt rejected clinical advice on care home testing”."
    },
    {
        "Date": "2 March 2023",
        "Event": "COVID-19 in the UK: The Daily Telegraph publishes more of Matt Hancock's WhatsApp exchanges, this time with former Education Secretary Gavin Williamson in Dec 2020, when a debate into whether schools should reopen following the Christmas holiday was taking place. The leaked messages suggest Hancock favoured school closures, while Williamson was more hesitant. Hancock, who worked alongside journalist Isabel Oakeshott to co-author a book, describes the release of the messages as a \"massive betrayal and breach of trust\". In response, Oakeshott says she released the messages because she believed doing so was in the \"public interest\"."
    },
    {
        "Date": "2 March 2023",
        "Event": "Sir Keir Starmer unveils Sue Gray, who led the investigation into the Partygate scandal, as Labour's new Chief of Staff, sparking concern among some Conservative MPs about her impartiality. On the same day, Gray resigns from her post as Cabinet Office Second Permanent Secretary and leaves the Civil Service."
    },
    {
        "Date": "3 March 2023",
        "Event": "The Commons Select Committee of Privileges finds that former Prime Minister Boris Johnson May 2023 have misled Parliament over the Partygate scandal after evidence suggested breaches of COVID-19 rules would have been \"obvious\" to him. In response Johnson says that none of the evidence shows he \"knowingly\" misled parliament, and that \"it is clear from this report that I have not committed any contempt of parliament\"."
    },
    {
        "Date": "3 March 2023",
        "Event": "The latest leaked WhatsApp messages published by the Daily Telegraph are reported as appearing to show former Health Secretary Matt Hancock and Cabinet Secretary Simon Case joking about locking people in quarantine hotels."
    },
    {
        "Date": "3 March 2023",
        "Event": "Rupa Huq is allowed to rejoin the Labour Party five months after being suspended over comments she made about former Conservative Chancellor Kwasi Kwarteng."
    },
    {
        "Date": "4 March 2023",
        "Event": "Leaked WhatsApp messages published by the Daily Telegraph indicate Matt Hancock and his staff deliberated over whether or not he had broken COVID-19 regulations after pictures of him kissing his aide, Gina Coladangelo, were published by The Sun newspaper. In another conversation, the messages show Hancock criticising the Eat Out to Help Out scheme for \"causing problems\" in areas where there was a high number of COVID-19 cases."
    },
    {
        "Date": "5 March 2023",
        "Event": "News outlets including BBC News, Sky News and The Independent (who have not verified the messages) report that further WhatsApp messages published by The Telegraph appear to show discussions about how and when the government should reveal details of the Kent COVID-19 variant in order to ensure people would comply with the regulations. The news outlets also says Hancock appears to suggest they should \"frighten the pants off everyone\", while in another conversation, head of the civil service Simon Case suggests the \"fear/guilt factor\" was an important element of the government's messaging. The Telegraph also reports messages showing ministers and civil servants discussing \" heavy with the police\" to enforce lockdown measures with senior police officers being brought into Number 10 to be told to be stricter with the public."
    },
    {
        "Date": "5 March 2023",
        "Event": "Speaking to the Mail on Sunday, Sunak says that migrants arriving in the UK on small boats will be prevented from seeking asylum under proposed new legislation to be brought before Parliament."
    },
    {
        "Date": "6 March 2023",
        "Event": "The Telegraph publishes messages that are reported to have been exchanged between Allan Nixon, a parliamentary Advisor and Hancock from November 2023 2020 in which they discuss threatening to cancel projects in MPs constituencies if MPs do not support the local lockdown tiers legislation. It is also reported that as part of a strategy aimed at trying to stop MPs from rebelling against the legislation, party whips compiled a spreadsheet of 95 MPs who disagreed with this policy and the reasons for them disagreeing; these related to lack of parliamentary scrutiny, economic harm, harms to hospital, absence of cost benefit analysis and the policy being \"unconservative\"."
    },
    {
        "Date": "7 March 2023",
        "Event": "Home Secretary Suella Braverman introduces the Illegal Migration Bill into the House of Commons, which is designed to stop migrants arriving in the UK by boat. The legislation proposes to detain and remove those from the UK who arrive by illegal means, as well as blocking them from returning."
    },
    {
        "Date": "7 March 2023",
        "Event": "STV hosts the first televised debate of the Scottish National Party leadership election."
    },
    {
        "Date": "9 March 2023",
        "Event": "The UK government announces a two-year delay in the construction of the Birmingham to Crewe leg of HS2 in order to save costs."
    },
    {
        "Date": "10 March 2023",
        "Event": "The King bestows the title of Duke of Edinburgh on his younger brother, Prince Edward."
    },
    {
        "Date": "13 March 2023",
        "Event": "Prime Minister Rishi Sunak announces an extra £5bn of government spending for UK defence over the coming two years."
    },
    {
        "Date": "13 March 2023",
        "Event": "Voting opens in the Scottish National Party leadership election."
    },
    {
        "Date": "14 March 2023",
        "Event": "BBC Scotland hosts the final televised debate of the SNP leadership election."
    },
    {
        "Date": "15 March 2023",
        "Event": "Chancellor of the Exchequer Jeremy Hunt presents the 2023 budget to the House of Commons."
    },
    {
        "Date": "16 March 2023",
        "Event": "The UK government announces that TikTok is to be banned on electronic devices used by ministers and other employees, amid security concerns relating to the Chinese-owned app's handling of user data. The Welsh Government also announces the app will be banned from all its official devices."
    },
    {
        "Date": "18 March 2023",
        "Event": "Peter Murrell resigns as chief executive of the Scottish National Party amid a row over party membership. Mike Russell succeeds him as interim chief executive."
    },
    {
        "Date": "19 March 2023",
        "Event": "The UK government launches the Emergency Alerts service, a service to send text alerts to mobile phones in a situation where it is perceived there is an immediate risk to life."
    },
    {
        "Date": "21 March 2023",
        "Event": "Partygate scandal: Former Prime Minister Boris Johnson publishes a 52-page defence of his actions during the COVID-19 pandemic in which he acknowledges misleading Parliament over the Partygate scandal, but says he did not do so intentionally."
    },
    {
        "Date": "21 March 2023",
        "Event": "At 8pm, Times Radio airs a leadership debate from Edinburgh and featuring the three candidates in the Scottish National Party leadership election."
    },
    {
        "Date": "21 March 2023",
        "Event": "Stormont is to ban Northern Ireland's civil servants from using the TikTok app on their official devices following a similar decision by the Westminster Government."
    },
    {
        "Date": "22 March 2023",
        "Event": "Boris Johnson gives evidence to the cross-party Privileges Committee, relating to his conduct during Partygate. He insists that he \"did not lie\" to the House of Commons and always made statements in good faith."
    },
    {
        "Date": "22 March 2023",
        "Event": "MPs back Rishi Sunak's new Brexit deal for Northern Ireland by 515 votes to 29."
    },
    {
        "Date": "22 March 2023",
        "Event": "Scotland's First Minister, Nicola Sturgeon, issues a \"sincere, heartfelt and unreserved\" apology to people affected by the practice of forced adoption in Scotland during the 1950s, 1960s and 1970s."
    },
    {
        "Date": "23 March 2023",
        "Event": "Nicola Sturgeon attends her final First Minister's Questions as First Minister of Scotland."
    },
    {
        "Date": "23 March 2023",
        "Event": "The TikTok app is banned on all Scottish Government phones and electric devices. The Westminster Parliament also announces that the app will be banned on \"all parliamentary devices and the wider parliamentary network\"."
    },
    {
        "Date": "24 March 2023",
        "Event": "MPs vote to back the Protection from Sex-based Harassment in Public Bill, which will make catcalling, following someone or blocking their path an offence in England and Wales with a punishment of up to two years in prison."
    },
    {
        "Date": "25 March 2023",
        "Event": "Reports in The Sun and i newspapers suggest former Prime Minister Liz Truss, who was in office for 49 days, has submitted a Resignation Honours list."
    },
    {
        "Date": "25 March 2023",
        "Event": "London City Hall bans its staff from using TikTok on all its official devices."
    },
    {
        "Date": "26 March 2023",
        "Event": "The Observer reports on a sting operation staged by the campaign group Led By Donkeys in which former ministers Matt Hancock and Kwasi Kwarteng agreed to work for a fake South Korean company for £10,000 per day."
    },
    {
        "Date": "27 March 2023",
        "Event": "Humza Yousaf succeeds Nicola Sturgeon as Leader of the SNP."
    },
    {
        "Date": "27 March 2023",
        "Event": "HM Treasury says it has scrapped plans for the Royal Mint to produce a government backed Non-fungible token that could be traded on international markets."
    },
    {
        "Date": "28 March 2023",
        "Event": "Humza Yousaf is confirmed as Scotland's First Minister by a vote in the Scottish Parliament."
    },
    {
        "Date": "28 March 2023",
        "Event": "Kate Forbes is to leave the Scottish Government after turning down a position in the Yousaf ministry."
    },
    {
        "Date": "28 March 2023",
        "Event": "Labour's National Executive Committee votes 22–12 in favour of a motion blocking former leader Jeremy Corbyn from standing as a Labour candidate at the next general election."
    },
    {
        "Date": "28 March 2023",
        "Event": "Conservative MPs Stuart Anderson and Nicola Richards announce they will not stand for Parliament at the next election."
    },
    {
        "Date": "29 March 2023",
        "Event": "Charles III begins a state visit to Germany, his first official overseas trip as monarch."
    },
    {
        "Date": "29 March 2023",
        "Event": "The UK government introduces the Victims and Prisoners Bill into the House of Commons, which will give ministers the power to veto the release of some prisoners, and restrict marriage in prison for those serving whole life terms."
    },
    {
        "Date": "29 March 2023",
        "Event": "Humza Yousaf is sworn in as Scotland's First Minister at Edinburgh's Court of Session and begins naming his cabinet."
    },
    {
        "Date": "30 March 2023",
        "Event": "During his state visit to Germany, Charles III becomes the first British monarch to address the Bundestag."
    },
    {
        "Date": "30 March 2023",
        "Event": "The Cabinet Office issues ministers with updated guidelines on the use of messaging apps such as WhatsApp for government business, advising them to use the apps \"with care\" and never to use them for information classified as \"secret\"."
    },
    {
        "Date": "30 March 2023",
        "Event": "The Parliamentary Standards Committee recommends that former Scottish National Party MP Margaret Ferrier be suspended from the House of Commons for 30 days for breaching COVID-19 regulations in Sep 2020 when she took a train home from London following a positive COVID test."
    },
    {
        "Date": "30 March 2023",
        "Event": "Humza Yousaf attends his first session of First Minister's Questions since his election as Scotland's First Minister. The session is interrupted on several occasions by climate change protestors, forcing the Presiding Officer of the Scottish Parliament to clear the gallery of visitors."
    },
    {
        "Date": "3 April 2023",
        "Event": "Environment Minister Therese Coffey confirms government plans to ban wet wipes containing plastic in England as a means of helping to tackle water pollution."
    },
    {
        "Date": "4 April 2023",
        "Event": "Immigration Minister Robert Jenrick is given a six-month driving ban by magistrates after he was caught speeding on the M1."
    },
    {
        "Date": "5 April 2023",
        "Event": "The UK government confirms plans to use the vessel Bibby Stockholm to house around 500 male migrants off the Dorset Coast, citing the cheaper cost of doing so compared to housing them in hotels."
    },
    {
        "Date": "5 April 2023",
        "Event": "Home Secretary Suella Braverman wins a selection for the newly created Parliamentary seat of Fareham and Waterlooville, beating fellow Conservative MP Flick Drummond."
    },
    {
        "Date": "5 April 2023",
        "Event": "The Times publishes video of an undercover investigation in which Conservative MP Scott Benton apparently offers to lobby on behalf of a fake company. Benton subsequently has the party whip withdrawn."
    },
    {
        "Date": "5 April 2023",
        "Event": "Police arrest former SNP chief executive Peter Murrell as part of their investigation into the party's finances and release him later without charge pending further investigation."
    },
    {
        "Date": "6 April 2023",
        "Event": "An inquiry concludes without being able to determine whether Conservative MP Mark Spencer told colleague Nus Ghani that her Muslim faith was a factor in her sacking."
    },
    {
        "Date": "7 April 2023",
        "Event": "BBC News reports that Johnston Carmichael, the accountants who audit the SNP's accounts, have resigned from the role, citing a their decision to do so as having been taken following a review of their clients."
    },
    {
        "Date": "7 April 2023",
        "Event": "Labour are accused by critics of practicing \"dog whistle\" and \"gutter politics\" following the release of adverts personally attacking Prime Minister Rishi Sunak with claims that he does not believe people convicted of child sex offences should be sent to prison."
    },
    {
        "Date": "8 April 2023",
        "Event": "SNP president Mike Russell tells The Herald newspaper he does not think Scottish independence can be achieved \"right now\", and that the party is facing its biggest crisis for 50 years."
    },
    {
        "Date": "10 April 2023",
        "Event": "Sir Keir Starmer says that he stands \"by every word\" of the Labour Party's adverts attacking Rishi Sunak despite criticism from fellow party members."
    },
    {
        "Date": "12 April 2023",
        "Event": "SNP leader Humza Yousaf confirms that his party will not pay any legal fees for former chief executive Peter Murrell, but that he will not be suspended from the party because he is \"innocent until proven guilty\"."
    },
    {
        "Date": "13 April 2023",
        "Event": "Andrew Edwards, a councillor representing a ward in Haverfordwest, is suspended from the Conservative Party after his voice is identified on a recording in which someone stating a belief that white men should have black slaves."
    },
    {
        "Date": "14 April 2023",
        "Event": "Sir Robert Goodwill, Conservative MP for Scarborough and Whitby, confirms he will stand down as an MP at the next general election."
    },
    {
        "Date": "15 April 2023",
        "Event": "The SNP's National Executive Committee orders a review of the party's transparency and governance."
    },
    {
        "Date": "15 April 2023",
        "Event": "Shaun Slater, a Bromley councillor who tweeted that it was \"more likely\" a rape victim was a prostitute whose \"punter... didn't pay\", is expelled from the Conservative Party."
    },
    {
        "Date": "16 April 2023",
        "Event": "Scotland's Sunday Mail publishes leaked video purporting to show Nicola Sturgeon playing down concerns about the SNP's finances."
    },
    {
        "Date": "16 April 2023",
        "Event": "The SNP says that its finances are \"in balance\" following reports the party is facing a financial crisis."
    },
    {
        "Date": "17 April 2023",
        "Event": "The Parliamentary Standards Commissioner is to investigate Prime Minister Rishi Sunak over a possible failure to declare an interest over a childcare company in which his wife has shares."
    },
    {
        "Date": "17 April 2023",
        "Event": "Sunak announces a review of the \"core maths content\" taught in England's schools, with the establishment of a panel to conduct the review."
    },
    {
        "Date": "17 April 2023",
        "Event": "MP Margaret Ferrier confirms she will appeal against her 30-day ban from the House of Commons."
    },
    {
        "Date": "18 April 2023",
        "Event": "SNP treasurer Colin Beattie is arrested and questioned by Police Scotland in connection with their ongoing investigation into the party's finances."
    },
    {
        "Date": "19 April 2023",
        "Event": "Downing Street publishes a full list of financial interests for all ministers, including those of Rishi Sunak which mention a childcare company in which his wife has shares. Sunak had previously declared the shares to government officials, Downing Street said, and BBC News said it was told that this happened before he became prime minister. Downing Street had previously said work on the new list was ongoing."
    },
    {
        "Date": "19 April 2023",
        "Event": "Colin Beattie resigns as SNP treasurer with immediate effect."
    },
    {
        "Date": "20 April 2023",
        "Event": "Prime Minister Rishi Sunak is handed the findings of an investigation into bullying allegations against Deputy Prime Minister Dominic Raab."
    },
    {
        "Date": "21 April 2023",
        "Event": "Dominic Raab resigns as Deputy Prime Minister after the inquiry finds he acted in an \"intimidating\" and \"insulting\" manner with civil servants. He is succeeded by Oliver Dowden, who becomes Deputy Prime Minister, and Alex Chalk, who takes on the role of Secretary of State for Justice. James Cartlidge replaces Chalk as Minister of State for Defence Procurement, and Cartlidge is replaced as Exchequer Secretary to the Treasury by backbencher Gareth Davies."
    },
    {
        "Date": "21 April 2023",
        "Event": "Raab subsequently criticises what he describes as \"activist civil servants\" attempting to block the work of government."
    },
    {
        "Date": "21 April 2023",
        "Event": "Chloe Smith is appointed as Secretary of State for Science and Innovation, standing in for Michelle Donelan during her maternity leave."
    },
    {
        "Date": "21 April 2023",
        "Event": "Julian Knight, the MP for Solihull, confirms he will stand down from Parliament at the next general election, and will also relinquish his role as chair of the House of Commons Digital, Culture, Media and Sport Committee."
    },
    {
        "Date": "23 April 2023",
        "Event": "Diane Abbott is suspended from the Labour Party after writing a letter in The Observer in which she downplays racism against Irish people, Jews, and Travellers."
    },
    {
        "Date": "23 April 2023",
        "Event": "The Emergency Alerts service is tested by the UK government at 3pm BST. An estimated 80% of smartphones are believed to be compatible to receive the alert, but around 7% of those do not receive it. Many people on the Three network report that the alert failed to appear on their phone, while others do not receive it because their phone is switched to aeroplane mode or they have disabled emergency alerts."
    },
    {
        "Date": "26 April 2023",
        "Event": "Andrew Bridgen is expelled from the Conservative Party after comparing COVID-19 vaccines to the Holocaust and being found to have breached lobbying rules."
    },
    {
        "Date": "26 April 2023",
        "Event": "The Illegal Migration Bill passes its final stage in the House of Commons, with MPs voting 289–230 in favour of the bill."
    },
    {
        "Date": "27 April 2023",
        "Event": "the Secretary of State for Business and Trade Kemi Badenoch announced that the government was planning to reduce the number of laws to be repealed to around 800, as opposed to the government's original target of around 4,000 laws. Such reversal was met with disMay 2023 by Brexit advocates, including the Bill's original architect Jacob Rees-Mogg."
    },
    {
        "Date": "28 April 2023",
        "Event": "Richard Sharp resigns as Chairman of the BBC over his breach of the BBC's rules regarding public appointments after failing to declare his connection to a loan secured by former Prime Minister Boris Johnson worth £800,000."
    },
    {
        "Date": "28 April 2023",
        "Event": "Prime Minister Rishi Sunak tells the Welsh Conservatives that no more powers should be devolved to the Senedd and the Welsh Government as voters do not want politicians focused on \"constitutional tinkeing\"."
    },
    {
        "Date": "29 April 2023",
        "Event": "The constituency Labour parties of Rutherglen and Hamilton, Larkhall and Stonehouse have written to Labour leader Sir Keir Starmer and Scottish Labour leader Anas Sarwar to make a formal complaint about the selection process for candidates, after being \"inundated\" with complaints by local members about a \"lack of transparency\"."
    },
    {
        "Date": "30 April 2023",
        "Event": "Former Prime Minister Liz Truss is contesting a bill of around £12,000 she has been asked to pay by the government for costs incurred at Chevening House in Kent during her time as Foreign Secretary and while she was a candidate in the Summer 2022 Conservative leadership election."
    },
    {
        "Date": "2 May 2023",
        "Event": "Deputy Prime Minister Oliver Dowden confirms that Sue Gray has chosen not to be interviewed for a Cabinet Office inquiry into her appointment as a senior Labour official. But Gray is cooperating with an Advisory Committee on Business Appointments inquiry into the appointment."
    },
    {
        "Date": "2 May 2023",
        "Event": "The Scottish Government reverses plans to give £46m to colleges and universities, having identified the money as an \"essential saving\"."
    },
    {
        "Date": "3 May 2023",
        "Event": "An independent review into the internal culture of Plaid Cymru identifies several issues within the party, and concludes that it needs to \"detoxify a culture of harassment, bullying and misogyny\"."
    },
    {
        "Date": "3 May 2023",
        "Event": "The SNP signs a contract with a new auditor, Manchester-based AMS Accountants Group."
    },
    {
        "Date": "4 May 2023",
        "Event": "The 2023 United Kingdom local elections are held. There are significant losses for the Conservatives, while Labour and the Lib Dems gain control of a number of councils from the Conservatives. The Green Party also makes record gains, with over 200 councillors, and win majority control of Mid Suffolk District Council, the party's first ever council majority. The UK Independence Party, which had 500 council seats in 2014, loses the remainder of its councillors."
    },
    {
        "Date": "6 May 2023",
        "Event": "The Coronation of Charles III and Camilla takes place at Westminster Abbey, London."
    },
    {
        "Date": "7 May 2023",
        "Event": "Leaked text message conversations obtained by the BBC show members of Plaid Cymru discussed whether the party's leader, Adam Price, was fit for office in November 2023 2022, and debated whether he should be removed from the post."
    },
    {
        "Date": "10 May 2023",
        "Event": "Following his expulsion from the Conservative Party for calling COVID-19 vaccines the \"biggest crime against humanity since the Holocaust,\" MP Andrew Bridgen announces he will join the Reclaim Party, giving the party its first parliamentary representative."
    },
    {
        "Date": "10 May 2023",
        "Event": "Adam Price announces his resignation as leader of Plaid Cymru after a report found a culture of misogyny, harassment and bullying in the party."
    },
    {
        "Date": "11 May 2023",
        "Event": "Kemi Badenoch, the Secretary of State for Business, is reprimanded in the House of Commons by Speaker Lindsay Hoyle after the UK government's decision to scrap plans to allow EU-era legislation to expire was reported in the media before it was announced to Parliament."
    },
    {
        "Date": "11 May 2023",
        "Event": "Llyr Gruffydd is appointed interim leader of Plaid Cymru following the resignation of Adam Price."
    },
    {
        "Date": "16 May 2023",
        "Event": "Javad Marandi, a businessman whose foreign companies were part of a global money laundering investigation, is named as a major donor to the Conservative Party."
    },
    {
        "Date": "16 May 2023",
        "Event": "Adam Price makes his final Senedd appearance as leader of Plaid Cymru."
    },
    {
        "Date": "17 May 2023",
        "Event": "The Renters (Reform) Bill is introduced into Parliament."
    },
    {
        "Date": "17 May 2023",
        "Event": "The Home Affairs Select Committee hears evidence about the Metropolitan Police's approach to public order during the Coronation."
    },
    {
        "Date": "17 May 2023",
        "Event": "First Minister of Scotland Humza Yousaf attends his first audience with King Charles III at Buckingham Palace."
    },
    {
        "Date": "17 May 2023",
        "Event": "Llyr Gruffydd formally succeeds Adam Price as leader of Plaid Cymru."
    },
    {
        "Date": "18 May 2023",
        "Event": "The 2023 Northern Ireland local elections are held. Sinn Féin sees a net gain of 39 seats, increasing the party's Councillor count from 105 to 144 Councillors. DUP seeing no net gain or loss, siting at 122 seats and Alliance having a net gain of 14 Councillors with most other parties seeing losses."
    },
    {
        "Date": "19 May 2023",
        "Event": "Data collected from 160 local authorities in England shows that 26,165 were turned away from polling stations during England's local elections for not having valid ID. Of those, 16,588 later returned with ID later in the day, while 9,577 did not return."
    },
    {
        "Date": "20 May 2023",
        "Event": "Sinn Féin are now the largest political party in Northern Ireland after making significant gains in the local election votes."
    },
    {
        "Date": "21 May 2023",
        "Event": "Labour and the Liberal Democrats call for an inquiry into Home Secretary Suella Braverman after it is reported she asked civil servants to arrange a private speed awareness course after she was caught speeding in summer 2022 during her tenure as Attorney General."
    },
    {
        "Date": "22 May 2023",
        "Event": "Former Deputy Prime Minister Dominic Raab announces he will stand down from Parliament at the next election."
    },
    {
        "Date": "23 May 2023",
        "Event": "The Cabinet Office has referred former Prime Minister Boris Johnson to the police following fresh allegations of rule breaches during the COVID-19 pandemic."
    },
    {
        "Date": "24 May 2023",
        "Event": "Prime Minister Rishi Sunak confirms that Home Secretary Suella Braverman's handling of a speeding offence did not breach ministerial rules and that she will not face an investigation."
    },
    {
        "Date": "24 May 2023",
        "Event": "Conservative MP Paul Bristow is asked to leave the House of Commons by Speaker Sir Lindsay Hoyle four minutes into Prime Minister's Questions for continuing to shout after MPs were warned about doing so."
    },
    {
        "Date": "24 May 2023",
        "Event": "Neil Coyle is reinstated as a Labour MP following a five-day suspension from the House of Commons after he was found to have breached harassment rules over racist comments he made to a journalist. Labour says his conduct will be monitored by the party's chief whip."
    },
    {
        "Date": "24 May 2023",
        "Event": "A group of eight former SNP councillors in North Lanarkshire form a new political party, Progressive Change NL, which becomes North Lanarkshire Council's second largest opposition party."
    },
    {
        "Date": "25 May 2023",
        "Event": "A proposed vote by MPs on a 30-day House of Commons ban for Margaret Ferrier is postponed after there are deemed to be too few MPs present for the vote to carry."
    },
    {
        "Date": "28 May 2023",
        "Event": "Four MPs who claimed fines for driving offences on their personal expenses have been asked to repay the money by parliamentary authorities."
    },
    {
        "Date": "28 May 2023",
        "Event": "The Home Office announces it is launching an ad campaign on social media in Albania to deter migrants from coming to the UK; the campaign will begin the following week."
    },
    {
        "Date": "31 May 2023",
        "Event": "Labour's Nick Thomas-Symonds defends the party's decision to accept money from green entrepreneur Dale Vince, a supporter of Just Stop Oil describing him as a \"legitimate person\" to accept money from, and says that it has nothing to do with the party's views on the protest organisation."
    },
    {
        "Date": "31 May 2023",
        "Event": "Personal trainer Henry Morris reveals himself to be the person behind a parody Twitter account titled Secret Tory."
    },
    {
        "Date": "1 June 2023",
        "Event": "Labour suspend MP Geraint Davies from the party following allegations that he subjected younger members to unwanted sexual attention."
    },
    {
        "Date": "1 June 2023",
        "Event": "The UK government confirms it will launch a legal challenge over the COVID-19 Inquiry's demand for the unredacted version of Boris Johnson's WhatsApp messages and emails as the deadline on which the inquiry had demanded access to them expires."
    },
    {
        "Date": "2 June 2023",
        "Event": "Former Prime Minister Boris Johnson announces he is bypassing the Cabinet Office by directly supplying the COVID-19 inquiry with unredacted copies of his WhatsApp messages and emails."
    },
    {
        "Date": "5 June 2023",
        "Event": "The Parliamentary Standards Committee finds former Conservative MP Matt Hancock (now sitting as an independent) guilty of attempting to influence an investigation into Conservative MP Steve Brine, and orders him to apologise to Parliament."
    },
    {
        "Date": "6 June 2023",
        "Event": "MPs vote to suspend Margaret Ferrier, the MP for Rutherglen and Hamilton West, from the House of Commons for 30 days for breaching COVID-19 regulations, almost certainly triggering a by-election in her constituency."
    },
    {
        "Date": "6 June 2023",
        "Event": "Ian Blackford, the SNP's leader at Westminster from 2017 to 2022, announces he will step down from Parliament at the next general election."
    },
    {
        "Date": "6 June 2023",
        "Event": "Kevin Stewart resigns as Scotland's Minister for Transport after experiencing poor mental health."
    },
    {
        "Date": "7 June 2023",
        "Event": "Labour MP and frontbencher Gerald Jones wins his party's selection to become the Labour candidate for the new parliamentary seat of Merthyr Tydfil and Upper Cynon, which will be contested at the next UK general election. The seat was ultimately renamed Merthyr Tydfil and Aberdare in the final recommendations."
    },
    {
        "Date": "7 June 2023",
        "Event": "Woking Borough Council imposes emergency spending restrictions on itself because of a £2bn debt."
    },
    {
        "Date": "8 June 2023",
        "Event": "Prime Minister Rishi Sunak holds a joint press conference with US President Joe Biden at the White House to announce the Atlantic Declaration, an agreement to strengthen economic ties between the UK and US."
    },
    {
        "Date": "8 June 2023",
        "Event": "Caroline Lucas, the Green Party's former leader and only MP, announces that she is stepping down from Parliament at the next election."
    },
    {
        "Date": "8 June 2023",
        "Event": "Businessman Mohamed Mansour has donated £5m to the Conservative Party."
    },
    {
        "Date": "9 June 2023",
        "Event": "Nadine Dorries announces she will stand down as Conservative MP for Mid Bedfordshire with immediate effect, triggering a by-election."
    },
    {
        "Date": "9 June 2023",
        "Event": "Boris Johnson's Resignation Honours are published. Highlights include knighthoods for Jacob Rees-Mogg and Simon Clarke, and a damehood for Priti Patel."
    },
    {
        "Date": "9 June 2023",
        "Event": "Johnson announces he will stand down as an MP with immediate effect after receiving the Commons Select Committee of Privileges's report into the Partygate scandal, triggering a by-election."
    },
    {
        "Date": "9 June 2023",
        "Event": "Shadow Chancellor Rachel Reeves announces a change of policy on Labour's 2021 pledge of an annual £28bn investment in green industry if the party wins the next election, saying the party must be \"responsible\" with public finances. She confirms that Labour would instead increase investment each year between 2024 (the expected date of the election) and 2027, when the annual amount would be £28bn."
    },
    {
        "Date": "9 June 2023",
        "Event": "Bambos Charalambous, the Shadow Minister for the Middle East and North Africa, is suspended from the Labour Party following complaints about his conduct."
    },
    {
        "Date": "9 June 2023",
        "Event": "Rhun ap Iorwerth is set to become the next leader of Plaid Cymru after the final two candidates seen as potential rivals in the party's leadership race, Sian Gwenllian and Sioned Williams, issue a joint statement ruling themselves out of the contest."
    },
    {
        "Date": "9 June 2023",
        "Event": "Health Minister Will Quince announces he will step down as a Conservative MP at the next general election."
    },
    {
        "Date": "10 June 2023",
        "Event": "Nigel Adams becomes the third Conservative MP in quick succession to stand down from Parliament with immediate effect, triggering a by-election."
    },
    {
        "Date": "11 June 2023",
        "Event": "Energy Secretary Grant Shapps, speaking on Sunday with Laura Kuenssberg, declares that the country \"wants to move on\" from Boris Johnson and dismisses claims the ex-PM was the victim of a \"witch hunt\"."
    },
    {
        "Date": "11 June 2023",
        "Event": "Police Scotland arrest Scotland's former First Minister, Nicola Sturgeon, as part of their ongoing investigation into the SNP's finances. She is subsequently released without charge."
    },
    {
        "Date": "12 June 2023",
        "Event": "The House of Lords Appointments Commission says that it rejected eight of Boris Johnson's nominations for peers after Sunak accuses Johnson of asking him to intervene in the process, something Johnson rejects."
    },
    {
        "Date": "12 June 2023",
        "Event": "Chris Bryant, chair of the Commons Select Committee of Privileges, describes attacks on the committee's procedures aas \"bang out of order\"."
    },
    {
        "Date": "12 June 2023",
        "Event": "With the findings of the Privileges Committee investigation into Boris Johnson scheduled to be published within days, Johnson submits an eleventh hour letter to the Committee at 23:57 on 12 Jun."
    },
    {
        "Date": "12 June 2023",
        "Event": "Scotland's First Minister, Humza Yousaf, tells BBC News he will not suspend Nicola Sturgeon from the SNP following her arrest."
    },
    {
        "Date": "12 June 2023",
        "Event": "The broadcasting regulator Ofcom announces it is conducting research into public attitudes towards current affairs programmes presented by politicians with a view to a potential change in the rules regarding such shows."
    },
    {
        "Date": "13 June 2023",
        "Event": "Màiri McAllan, Scotland's Cabinet Secretary for Net Zero and Just Transition, is additionally appointed as Minister for Transport, replacing Kevin Stewart in the role."
    },
    {
        "Date": "13 June 2023",
        "Event": "Independent councillor Ieuan Williams stands down as deputy leader of Isle of Anglesey County Council after telling a meeting the previous evening that \"all Tories should be shot\". Apologising for the comment, Williams says he was \"angry and emotional\" about poverty at the time."
    },
    {
        "Date": "15 June 2023",
        "Event": "Partygate: A report by MPs concludes that ex-Prime Minister Boris Johnson deliberately misled the Commons over lockdown parties at 10 Downing Street, and would be suspended for 90 days if still an MP. It states that he deliberately misled the House, the committee, impugned the committee and was \"complicit in the campaign of abuse and attempted intimidation of the Committee\"."
    },
    {
        "Date": "15 June 2023",
        "Event": "Lucy Allan, Conservative MP for Telford, announces she will stand down from Parliament at the next general election."
    },
    {
        "Date": "15 June 2023",
        "Event": "Scotland's First Minister, Humza Yousaf, concludes that Jenny Gilruth did not break the ministerial code during her time as the country's Transport Minister. The announcement comes after Scottish Conservatives leader Douglas Ross suggested she had done so by delaying important railways work that cost £1m."
    },
    {
        "Date": "16 June 2023",
        "Event": "Rhun ap Iorwerth is elected unopposed as the new leader of Plaid Cymru."
    },
    {
        "Date": "16 June 2023",
        "Event": "The Daily Mail announces it has signed up Boris Johnson as a columnist, prompting the House of Commons Advisory Committee on Business Appointments to investigate whether he has breached the Ministerial Code by not consulting them before accepting the role."
    },
    {
        "Date": "16 June 2023",
        "Event": "After several of Johnson's former Conservative colleagues threaten to vote against the Privileges Committee report when it is brought before Parliament, Johnson asks them not to do so."
    },
    {
        "Date": "16 June 2023",
        "Event": "Buckingham Palace announces that Charles III has given Queen Camilla Scotland's highest honour, the Order of the Thistle."
    },
    {
        "Date": "16 June 2023",
        "Event": "The Labour Party selects their candidates for upcoming by-elections; Keir Mather in Selby and Ainsty and Alistair Strathern in Mid Bedfordshire."
    },
    {
        "Date": "16 June 2023",
        "Event": "The Conservatives choose Bedfordshire Police and Crime Commissioner Festus Akinbusoye as their candidate for the by-election in Mid Bedfordshire."
    },
    {
        "Date": "16 June 2023",
        "Event": "Alison McGovern defeats Mick Whitley for the selection for the new Birkenhead constituency."
    },
    {
        "Date": "17 June 2023",
        "Event": "The 2023 Birthday Honours are announced awarding politicians with honours; Ben Bradshaw gets a knighthood, Jackie Baillie gets a damehood, John Baron and Bob Blackman are both made CBEs, while Conservative former ministers Damian Collins and Heather Wheeler become OBEs."
    },
    {
        "Date": "17 June 2023",
        "Event": "David Warburton, the MP for Somerton and Frome, becomes the fourth Conservative MP in eight days to announce their resignation from the House of Commons, doing so following suspension from the party over allegations of sexual misconduct, and triggering a by-election in his constituency."
    },
    {
        "Date": "18 June 2023",
        "Event": "Partygate:"
    },
    {
        "Date": "18 June 2023",
        "Event": "The Mirror publishes video footage of a party held in Dec 2020 at Conservative Party Headquarters. Housing Secretary Michael Gove describes the incident as \"indefensible\"."
    },
    {
        "Date": "18 June 2023",
        "Event": "Gove tells Sunday with Laura Kuenssberg that Johnson's 90-day suspension is \"not merited\" and that he will not vote for it."
    },
    {
        "Date": "19 June 2023",
        "Event": "Partygate:"
    },
    {
        "Date": "19 June 2023",
        "Event": "BBC News reports that it has seen an invitation sent out to 30 people by Ben Mallett, a former aide to Boris Johnson, in which they were invited to \"jingle and mingle\" at a party held at Conservative Party Headquarters on 14 Dec 2020, while London was in Tier 2 restrictions."
    },
    {
        "Date": "19 June 2023",
        "Event": "MPs back, by 354 votes to seven, a report finding Boris Johnson deliberately misled the Commons over lockdown parties at Downing Street."
    },
    {
        "Date": "20 June 2023",
        "Event": "The Chancellor, Jeremy Hunt, rules out direct financial support for mortgage holders, over fears it would \"make inflation worse, not better\"."
    },
    {
        "Date": "20 June 2023",
        "Event": "A recall petition opens in the Rutherglen and Hamilton West constituency to determine whether Margaret Ferrier will face a by-election; 10% of eligible voters must sign it to trigger the by-election."
    },
    {
        "Date": "20 June 2023",
        "Event": "SNP MP John Nicolson is cleared of bullying allegations against former Conservative minister Nadine Dorries."
    },
    {
        "Date": "21 June 2023",
        "Event": "Welsh Conservative Member of the Senedd Tom Giffard gives a speech in the Senedd congratulating Wales for winning the 2023 World Cup of Darts generated by the ChatGPT chatbot."
    },
    {
        "Date": "22 June 2023",
        "Event": "Defence Secretary Ben Wallace, considered a possible successor to Jens Stoltenberg as Secretary General of NATO when Stoltenberg's term ends in Sep, rules himself out of the position in an interview with The Economist."
    },
    {
        "Date": "22 June 2023",
        "Event": "MSPs vote 66–44 to approve the Bail and Release from Custody (Scotland) Bill, designed to reduce Scotland's prison population."
    },
    {
        "Date": "23 June 2023",
        "Event": "Conservative MP Steve Brine, chair of the Commons Health and Social Care Committee, announces his intention to stand down as an MP at the next general election."
    },
    {
        "Date": "24 June 2023",
        "Event": "The UK government holds an emergency COBRA meeting to discuss the Wagner Group rebellion in Russia. Sunak urges both sides to \"be responsible and to protect civilians\"."
    },
    {
        "Date": "24 June 2023",
        "Event": "Addressing a convention in Dundee, Scotland's First Minister, Humza Yousaf, says the SNP will use the next general election as a referendum to negotiate independence with the UK government if the party wins a majority in Scotland."
    },
    {
        "Date": "26 June 2023",
        "Event": "Daniel Korski, a former Downing Street adviser, rejects \"in the strongest possible terms\" a claim by journalist and author Daisy Goodwin that he groped her during a meeting at Downing Street in 2013."
    },
    {
        "Date": "27 June 2023",
        "Event": "Virginia Crosbie, the MP for Ynys Môn, apologises for attending a drinks event at Westminster on 8 December 2020 after the Guido Fawkes website reported she was a co-host of the event."
    },
    {
        "Date": "28 June 2023",
        "Event": "The final proposals for the 2023 Periodic Review of Westminster constituencies are published, and see changes to constituencies in England, Scotland and Wales. The overall number of MPs elected at the next general election will remain at 650, but the number of seats will change from 533 to 543 in England, 40 to 32 in Wales, and 59 to 57 in Scotland. The review, which takes account of changes in population, will also see some prominent MPs, such as Conservative Defence Secretary Ben Wallace and Labour's Shadow Chancellor Rachel Reeves, lose their seats as they are abolished, requiring them to undergo a fresh selection process for alternative seats."
    },
    {
        "Date": "28 June 2023",
        "Event": "Stewart Hosie, MP for Dundee East and former SNP deputy leader, confirms he will stand down from Parliament at the next general election."
    },
    {
        "Date": "28 June 2023",
        "Event": "Daniel Korski withdraws from the contest to be the Conservative candidate for the 2024 London May 2023oral election following allegations he groped journalist and author Daisy Goodwin."
    },
    {
        "Date": "28 June 2023",
        "Event": "Robin Millar resigns as a parliamentary aide to Welsh Secretary David TC Davies in order to vote against legislation that makes it compulsory for schools in Northern Ireland to teach all post-primary school children about abortion and birth control. The legislation passes by 373–28."
    },
    {
        "Date": "29 June 2023",
        "Event": "Commons Privileges Committee investigation into Boris Johnson: The Commons Select Committee of Privileges publishes a 14-page repot outlining what it describes as a co-ordinated campaign by allies of Johnson to interfere in their investigation into him. The report names ten Conservative MPs, including Nadine Dorries, Jacob Rees-Mogg and Priti Patel who it says mounted \"vociferous attacks\" against the committee."
    },
    {
        "Date": "29 June 2023",
        "Event": "Rwanda Asylum Plan: The plan to deport some asylum seekers to Rwanda is ruled unlawful. In a three-judge decision, the court of appeal overturns a high court decision that previously ruled that Rwanda could be considered a safe third country to send refugees."
    },
    {
        "Date": "29 June 2023",
        "Event": "A Local Government Association survey indicates that one in ten councils in England have had councillors stand down from office due to a legal requirement that council meetings should be held in person. The rule was suspended during the pandemic, but reinstated in M*y 2021."
    },
    {
        "Date": "29 June 2023",
        "Event": "Conservative MP Lee Anderson faces censure from the Serjeant at Arms of the House of Commons for filming a promotional video for his GB News programme on Parliamentary property without permission."
    },
    {
        "Date": "30 June 2023",
        "Event": "Zac Goldsmith resigns as Minister of State for Overseas Territories, Commonwealth, Energy, Climate and Environment after he was accused by the Privileges Committee of interfering with their work. Goldsmith said he resigned over a long-standing climate issue, something Sunak contradicted when he said that Goldsmith resigned because he refused to apologise for criticising the Committee investigation into Johnson. Goldsmith later said that was wrong."
    },
    {
        "Date": "30 June 2023",
        "Event": "The Advisory Committee on Business Appointments clears Sue Gray to work for the Labour Party from Sep 2023."
    },
    {
        "Date": "30 June 2023",
        "Event": "The High Court hears the UK government's legal challenge to the UK COVID-19 Inquiry's demand for full access to Johnson's diaries and WhatsApp messages."
    },
    {
        "Date": "30 June 2023",
        "Event": "The UK government says it will not investigate allegations of groping made against Daniel Korski."
    },
    {
        "Date": "30 June 2023",
        "Event": "Rwanda Asylum Plan: Justine Greening, a former International Development Secretary, warns the UK's deal to deport asylum seekers to Rwanda risks \"downgrading\" UK foreign policy."
    },
    {
        "Date": "1 July 2023",
        "Event": "Local Government Minister Lee Rowley formally writes to South Cambridgeshire District Council to request they end their trial of a four-day working week \"immediately\" amid concerns about \"value for money\". The scheme, launched in Jan 2023, is scheduled to run until Mar 2024."
    },
    {
        "Date": "1 July 2023",
        "Event": "First Minister of Scotland Humza Yousaf announces that the SNP has changed the way it records donations after the issue was highlighted by its auditors. Having previously only kept online records of donations under £250, the party will now keep documented records of the donations."
    },
    {
        "Date": "1 July 2023",
        "Event": "Sir Gavin Williamson, MP for South Staffordshire, is chosen as the Conservative candidate for the newly created constituency of Stone, Great Wyrley and Penkridge, which will be contested at the next general election."
    },
    {
        "Date": "2 July 2023",
        "Event": "The Labour Party announces that a future Labour government will give newly qualified teachers in England a £2,400 payment to stop them leaving the profession."
    },
    {
        "Date": "2 July 2023",
        "Event": "During an appearance on BBC Radio Scotland's The Sunday Show, Scottish Conservative MSP Jamie Greene alleges that he lost his post in the Shadow Cabinet of Douglas Ross for supporting the Scottish Government's controversial Gender Recognition Reform Bill."
    },
    {
        "Date": "3 July 2023",
        "Event": "The Cabinet Office finds that Sue Gray broke civil service rules by failing to declare that she was in talks with Labour about a job with the party. Labour dismisses the finding as a \"political stunt\"."
    },
    {
        "Date": "3 July 2023",
        "Event": "Members of Orkney Islands Council, a Council area of Scotland, vote 15–6 in favour of investigating alternative methods of government that includes the potential to become a crown dependency of the UK or a self-governing territory of Norway."
    },
    {
        "Date": "3 July 2023",
        "Event": "Illegal Migration Bill: The House of Lords votes to limit the time which children and pregnant women can be held before being deported for entering the UK illegally."
    },
    {
        "Date": "3 July 2023",
        "Event": "A group of Conservative MPs calling themselves the New Conservatives publish a 12-point plan intended to reduce net migration to the UK, and warn Sunak that failure to tackle the issue \"risks eroding public trust\"."
    },
    {
        "Date": "4 July 2023",
        "Event": "The Metropolitan Police announces it is reopening its investigation into a lockdown party held at Conservative Party Headquarters in Dec 2020, as well as an event held at Westminster on 8 Dec 2020."
    },
    {
        "Date": "4 July 2023",
        "Event": "SNP MP Mhairi Black announces she will stand down from Parliament at the next general election."
    },
    {
        "Date": "5 July 2023",
        "Event": "King Charles III is presented with the Honours of Scotland during a ceremony held at Edinburgh's St Giles Cathedral."
    },
    {
        "Date": "5 July 2023",
        "Event": "SNP MP Angus McNeil is suspended from the party for a week following an argument with the party's chief whip, Brendan O'Hara, after he allegedly threatened O'Hara."
    },
    {
        "Date": "5 July 2023",
        "Event": "Media expert Chris Banatvala, who drew up the UK's broadcasting rules, urges Ofcom to decide whether politicians should be allowed to present programmes on news channels."
    },
    {
        "Date": "5 July 2023",
        "Event": "Six members of Parliamentary staff tell BBC Newsnight that a \"predatory culture\" still exists in Westminster, with abuses of power by male MPs and senior staffers common."
    },
    {
        "Date": "6 July 2023",
        "Event": "The Parliamentary Commissioner for Standards recommends that MP Chris Pincher be suspended for eight weeks, following an investigation into groping allegations."
    },
    {
        "Date": "6 July 2023",
        "Event": "The UK government loses a High Court bid to prevent the COVID-19 Inquiry from seeing Boris Johnson's diaries and WhatsApp messages in full."
    },
    {
        "Date": "6 July 2023",
        "Event": "Caroline Nokes, who chairs the House of Commons Women and Equalities Committee, tells the BBC's Newsnight programme she has experienced inappropriate behaviour at Westminster around 30 times since becoming an MP, and that describes what some women working at Westminster have been through as \"horrific\"."
    },
    {
        "Date": "6 July 2023",
        "Event": "The Scottish and UK governments confirm plans to collaborate on new legislation to prevent landlords excluding parents and people on benefits from renting properties."
    },
    {
        "Date": "7 July 2023",
        "Event": "Christina Rees, a former Shadow Secretary of State for Wales, is prevented from seeking selection as the Labour candidate for the newly created constituency of Neath and Swansea East due to her suspension from Labour over bullying allegations."
    },
    {
        "Date": "7 July 2023",
        "Event": "The Scottish Government urges Westminster to decriminalise the personal possession of all illegal drugs, and puts forward a number of proposals for the managed use of drugs."
    },
    {
        "Date": "7 July 2023",
        "Event": "Ofcom launches an investigation into a GB News campaign that urges the UK government to introduce legislation to stop \"Britain becoming a cashless society\" following a complaint. The \"Don't Kill Cash\" petition, which has been signed by more than 166,000 people, potentially breaches Ofcom's rules that require broadcasters to not comment on \"matters of political and industrial controversy or current public policy\"."
    },
    {
        "Date": "8 July 2023",
        "Event": "It is reported that members of Flintshire County Council are to be given lessons in respect after one of its members called Wales's First Minister, Mark Drakeford, \"Führer\" on Facebook."
    },
    {
        "Date": "9 July 2023",
        "Event": "US President Joe Biden arrives in the UK for a brief visit ahead of a NATO summit in Lithuania."
    },
    {
        "Date": "10 July 2023",
        "Event": "US President Joe Biden meets King Charles III at Windsor Castle during a trip to the UK."
    },
    {
        "Date": "10 July 2023",
        "Event": "Daniel Greenberg, the Parliamentary Commissioner for Standards, says that Parliament must improve its complaints system following a number of misconduct allegations by MPs."
    },
    {
        "Date": "10 July 2023",
        "Event": "John McNally, MP for Falkirk, says he will stand down from Parliament at the next election, becoming the seventh SNP MP to do so."
    },
    {
        "Date": "10 July 2023",
        "Event": "The Parliamentary Commissioner for Standards opens an investigation into Conservative MP Lee Anderson for using the roof of his Westminster office to film a promotional video for his GB News show."
    },
    {
        "Date": "10 July 2023",
        "Event": "MPs approve the Privileges Committee report that accused Johnson's allies of running a co-ordinated campaign to interfere with the report into Johnson."
    },
    {
        "Date": "11 July 2023",
        "Event": "MPs overturn many of the 20 changes the House of Lords made to the Illegal Migration Bill, but the government makes concessions on the detention of children and pregnant women."
    },
    {
        "Date": "11 July 2023",
        "Event": "In the Senedd, Wales's First Minister, Mark Drakeford, defends the country's former Health Minister Vaughan Gething for not reading pandemic paperwork until he prepared for the COVID-19 inquiry, but Andrew RT Davies, leader of the Welsh Conservatives questions how there can be confidence in Gething's current job as Economy Minister."
    },
    {
        "Date": "11 July 2023",
        "Event": "MPs on the Public Bills Committee vote 9–6 against an amendment to the Victims and Prisoners Bill that would remove parental rights from a person convicted of murdering their partner for the duration of their sentence."
    },
    {
        "Date": "12 July 2023",
        "Event": "Cabinet Secretary Simon Case refers Nadine Dorries to the Conservative Whip following allegations she sent \"forceful\" messages to officials."
    },
    {
        "Date": "12 July 2023",
        "Event": "Simon Case urges politicians to stop referring to the Civil Service as \"the Blob\", describing the term \"insulting\" and \"dehumanising\"."
    },
    {
        "Date": "13 July 2023",
        "Event": "Illegal Migration Bill: The House of Lords rejects government plans to extend the amount of time migrant children can be held in detention, and also votes to increase protection for people claiming to be the victims of human trafficking."
    },
    {
        "Date": "13 July 2023",
        "Event": "Labour announce plans to reform the Parliamentary standards system if they win the next general election, including levying fines for former ministers who breach lobbying rules."
    },
    {
        "Date": "14 July 2023",
        "Event": "The High Court of England and Wales gives its approval to legal challenges against the Home Office by Braintree District Council in Essex and West Lindsey District Council in Lincolnshire over plans to use two former airbases in the areas, Weathersfield Airbase and RAF Scampton, to house asylum seekers."
    },
    {
        "Date": "14 July 2023",
        "Event": "A report into UK dentistry published by the Commons Health and Social Care Select Committee concludes that it is \"totally unacceptable\" that many people do not have access to a dentist, and calls for more to be done to facilitate this."
    },
    {
        "Date": "14 July 2023",
        "Event": "Angus MacNeil is suspended from the SNP after declining an invitation to rejoin the party at Westminster."
    },
    {
        "Date": "15 July 2023",
        "Event": "Secretary of State for Defence Ben Wallace announces his intention to stand down from the Cabinet at the next reshuffle, and to stand down as an MP at the next general election when his constituency will be abolished because of boundary changes."
    },
    {
        "Date": "15 July 2023",
        "Event": "Angus MacNeil urges the UK government to reopen the Energy Bill Support Scheme Alternative Funding programme, designed to help households that missed out on the £400 worth of financial help given to households in the winter of 2022–23 after it emerged that of the one million households eligible to apply to the scheme only a fraction received any funds."
    },
    {
        "Date": "16 July 2023",
        "Event": "Kemi Badenoch, the Secretary of State for Business and Trade, formally signs a treaty confirming accession to the Indo-Pacific CPTPP bloc. The deal is forecast to add 0.08% to the UK's economy over ten years."
    },
    {
        "Date": "17 July 2023",
        "Event": "The Illegal Migration Bill is set to become law after the House of Lords votes not to reinstate time limits on child detention and protections concerning modern slavery."
    },
    {
        "Date": "18 July 2023",
        "Event": "Philippa Whitford, MP for Central Ayrshire, announces she will stand down from Parliament at the next general election, becoming the eighth SNP MP to do so."
    },
    {
        "Date": "18 July 2023",
        "Event": "Scottish Labour says it will continue to oppose the two-child cap on Universal Credit and Child Tax Credit after UK Labour leader Sir Keir Starmer said he would not abolish the rule without growing the economy."
    },
    {
        "Date": "18 July 2023",
        "Event": "Jamie Driscoll, the North of Tyne M*yor, resigns from the Labour Party after being blocked from standing for the newly-created role of North East M*yor."
    },
    {
        "Date": "18 July 2023",
        "Event": "Writing for The Telegraph, former UKIP and Brexit Party leader Nigel Farage claims to have evidence that Coutts bank decided to close his account because his views \"do not align\" with theirs. The report obtained by Farage is subsequently published in the Daily Mail."
    },
    {
        "Date": "18 July 2023",
        "Event": "Troubles Legacy Bill: MPs vote 292–200 in favour of reinstating the amnesty to those who cooperate with investigations under the new Independent Commission for Reconciliation and Information Recovery (ICRIR)."
    },
    {
        "Date": "19 July 2023",
        "Event": "The Conservative Party have complained to the Evening Standard about their front page coverage of the party's selection of Susan Hall as its candidate for the 2024 London May 2023oral election, claiming the coverage is \"contemptable\"."
    },
    {
        "Date": "20 July 2023",
        "Event": "Parliamentary by-elections are held in Somerton and Frome, Uxbridge and South Ruislip, and Selby and Ainsty."
    },
    {
        "Date": "20 July 2023",
        "Event": "Nigel Farage receives an apology from Dame Alison Rose, the chief executive of NatWest Bank, for \"deeply inappropriate\" comments made about him in a report on his suitability as a customer at Coutts Bank. The UK government also announces that banks will be required to fully explain their reasons for closing people's accounts."
    },
    {
        "Date": "20 July 2023",
        "Event": "It is reported that former Permanent Secretary to the Treasury Sir Tom Scholar received a £335,000 payment for \"loss of office\" after he was sacked by Liz Truss when she became prime minister in Sep 2022."
    },
    {
        "Date": "20 July 2023",
        "Event": "Downing Street criticises the European Union for using the term Las Malvinas, Argentina's name for the Falkland Islands, in an official document."
    },
    {
        "Date": "20 July 2023",
        "Event": "Chris Pincher appeals against his eight-week suspension from Parliament."
    },
    {
        "Date": "20 July 2023",
        "Event": "The Strikes (Minimum Service Levels) Bill is signed into law."
    },
    {
        "Date": "21 July 2023",
        "Event": "Jul 2023 by-elections:"
    },
    {
        "Date": "21 July 2023",
        "Event": "Uxbridge and South Ruislip: The former seat of ex-PM Boris Johnson is held by the Conservatives, but with a reduced majority of 495 votes. Steve Tuckwell becomes the constituency's MP. The proposed ULEZ expansion by Labour's Sadiq Khan, M*yor of London, is a factor in the result."
    },
    {
        "Date": "21 July 2023",
        "Event": "Selby and Ainsty: Labour takes the formerly safe Conservative seat of Selby and Ainsty. The swing of 23.7% is the largest since 1945. Keir Mather becomes the constituency's new MP, and at 25, the youngest Member of Parliament and Baby of the House."
    },
    {
        "Date": "21 July 2023",
        "Event": "Somerton and Frome: The Liberal Democrats take Somerton and Frome, overturning a Conservative majority of 29.6%. Sarah Dyke is elected as the constituency's new MP."
    },
    {
        "Date": "23 July 2023",
        "Event": "The Cabinet Office announces the launch of the Humanitarian Medal for emergency workers and humanitarian relief teams, such as charities, service personnel and health workers."
    },
    {
        "Date": "24 July 2023",
        "Event": "Trudy Harrison, MP for Copeland, announces she will not stand for Parliament at the next election."
    },
    {
        "Date": "24 July 2023",
        "Event": "Charlotte Owen, a former adviser to Boris Johnson, joins the House of Lords as its youngest life peer at the age of 30, becoming Baroness Owen of Alderley Edge. Her appointment was announced on 12 Jul."
    },
    {
        "Date": "24 July 2023",
        "Event": "The Cabinet Office confirms that controversial guidance used to vet potential speakers for government organised events has been withdrawn."
    },
    {
        "Date": "25 July 2023",
        "Event": "Dame Alison Rose admits to being the source of an inaccurate BBC news report about Nigel Farage's Coutts bank account after discussing the matter with BBC business editor Simon Jack, something she describes as a \"serious error of judgement\". She subsequently resigns from her post early the next day."
    },
    {
        "Date": "25 July 2023",
        "Event": "Labour abandons proposals to allow people to legally change their sex without a medical diagnosis. This policy is in juxtaposition to Scottish Labour which confirms it still supports removing the requirement."
    },
    {
        "Date": "25 July 2023",
        "Event": "The Culture, Media and Sport Committee writes to The Sun and the BBC to gain a better understanding of their handling of allegations made against BBC newsreader Huw Edwards."
    },
    {
        "Date": "27 July 2023",
        "Event": "First Minister of Scotland Humza Yousaf unveils a new Scottish Government paper on independence that includes plans for Scottish citizenship and passports."
    },
    {
        "Date": "28 July 2023",
        "Event": "Gina Miller, leader of the True and Fair Party, reveals she was told one of the party's bank accounts would be close without explanation by Monzo. The bank has since confirmed it does now allow accounts for political parties."
    },
    {
        "Date": "30 July 2023",
        "Event": "Nigel Farage launches AccountClosed.org, a website he says will stand up for people who have been refused bank accounts."
    },
    {
        "Date": "31 July 2023",
        "Event": "Nick Timothy is selected as the Conservative Party candidate for the West Suffolk constituency, the seat currently occupied by former Health Secretary Matt Hancock."
    },
    {
        "Date": "31 July 2023",
        "Event": "The 2023 Rutherglen and Hamilton West recall petition closes. A by-election is triggered after the petition to remove Margaret Ferrier from office is signed by 11,896 of the 81,124 eligible constituents, passing the required 10% threshold."
    },
    {
        "Date": "1 August 2023",
        "Event": "The Department for Business and Trade announces that the CE marking will continue to be recognised on products sold in the UK, rather than being replaced by a post-Brexit British logo, which was scheduled to happen in 2024."
    },
    {
        "Date": "2 August 2023",
        "Event": "Robin Harper, who in 1999 became the first Green parliamentarian after he was elected to the Scottish Parliament, resigns his life membership of the Scottish Greens claiming the party has \"lost the plot\"."
    },
    {
        "Date": "2 August 2023",
        "Event": "Gwent Police says it is \"reviewing\" the content of a leaflet sent to constituents by Conservative MP David TC Davies discussing traveller sites in the area. They subsequently announce Davies will face no action over the leaflet."
    },
    {
        "Date": "3 August 2023",
        "Event": "Five people are arrested after environmental protestors from Greenpeace climb on the roof of the North Yorkshire home of Rishi Sunak in protest at the Prime Minister's decision to award 100 new oil contracts."
    },
    {
        "Date": "4 August 2023",
        "Event": "Chancellor Jeremy Hunt instructs the Financial Conduct Authority to speed up their investigation into whether people have had their bank accounts closed because of their political views."
    },
    {
        "Date": "4 August 2023",
        "Event": "Comedian Eddie Izzard announces plans to stand in one of Brighton's constituencies at the next general election."
    },
    {
        "Date": "4 August 2023",
        "Event": "A royal spokesman confirms there will be no official public events to mark the first anniversary of the death of Elizabeth II."
    },
    {
        "Date": "4 August 2023",
        "Event": "Edinburgh's Court of Session rejects an attempt by the Scottish Government to delay the hearing into its legal challenge against Westminster's decision to block the Gender Recognition Reform (Scotland) Bill. The Scottish Government had wanted it delayed until after a separate hearing into determining the definition of a woman."
    },
    {
        "Date": "4 August 2023",
        "Event": "The Conservatives lose East Sussex County Council to no overall control for the first time since 2017 following a council by-election."
    },
    {
        "Date": "5 August 2023",
        "Event": "Former Labour leader Jeremy Corbyn says he will consider running as an Independent in the 2024 London May 2023oral election."
    },
    {
        "Date": "7 August 2023",
        "Event": "Ofcom launches investigations into GB News programmes presented by MPs Jacob Rees-Mogg, Philip Davies and Esther McVey."
    },
    {
        "Date": "7 August 2023",
        "Event": "The UK government cut ties with Greenpeace after a protest at the Prime Ministers home at Kirby Sigston Manor."
    },
    {
        "Date": "8 August 2023",
        "Event": "The Electoral Commission warns people to look out for unauthorised use of their data after revealing it was the victim of a \"complex cyber-attack\" in August 2023 2021, which was not discovered until October 2023 2022."
    },
    {
        "Date": "9 August 2023",
        "Event": "First Minister of Wales Mark Drakeford confirms he will leave the Senedd at the Next Senedd election; he is expected to stand down as First Minister before then."
    },
    {
        "Date": "9 August 2023",
        "Event": "Drakeford asks ministers to make cuts to public services in Wales as inflation and public sector pay place constraints on the Welsh Government's budget."
    },
    {
        "Date": "10 August 2023",
        "Event": "Stuart Andrew, MP for Pudsey, confirms he will not stand again for parliament at the next general election."
    },
    {
        "Date": "11 August 2023",
        "Event": "Ministry of Defence data indicates Rishi Sunak has taken more domestic flights during his time as prime minister than his three predecessors did during their terms in office."
    },
    {
        "Date": "11 August 2023",
        "Event": "Theresa Villiers, a former Secretary of State for the Environment, apologises after revealing that she failed to declare £70,000 of shares in Shell during her time in the role."
    },
    {
        "Date": "11 August 2023",
        "Event": "Rob Blackie is announced as the Liberal Democrat candidate for the 2024 London May 2023oral election."
    },
    {
        "Date": "11 August 2023",
        "Event": "Angus McNeil, MP for the Western Isles, is expelled from the SNP following his disagreement with the party's Chief Whip at Westminster."
    },
    {
        "Date": "13 August 2023",
        "Event": "Following calls from some senior SNP figures for a review, Ian Blackford, the SNP's former leader at Westminster, confirms the SNP–Green agreement at Holyrood will remain in place until 2026."
    },
    {
        "Date": "15 August 2023",
        "Event": "Global Media & Entertainment have rejected an Alba Party poster depicting Rishi Sunday as a vampire feeding off Scottish oil because it \"slandered\" the prime minister."
    },
    {
        "Date": "17 August 2023",
        "Event": "The Saudi Arabian embassy in the UK announces that Crown Prince Mohammed bin Salman has been invited to visit the UK, although Downing Street says there are no plans in the prime minister's diary for a visit."
    },
    {
        "Date": "18 August 2023",
        "Event": "Foreign Secretary James Cleverly is to travel to Australia to attend the 2023 FIFA Women's World Cup Final as England take on Spain."
    },
    {
        "Date": "18 August 2023",
        "Event": "Dafydd Elis-Thomas, a former leader of Plaid Cymru who left the party in 2016 after criticising it, has applied to rejoin."
    },
    {
        "Date": "23 August 2023",
        "Event": "Murray Foote is appointed as the SNP's new chief executive, replacing Peter Murrell."
    },
    {
        "Date": "24 August 2023",
        "Event": "The Parliamentary Commissioner for Standards rules that Rishi Sunak failed to declare his wife's financial interests in a childminding business correctly."
    },
    {
        "Date": "25 August 2023",
        "Event": "Following a review of MPs severance pay, the Independent Parliamentary Standards Authority announces the money paid to MPs leaving Parliament at the next election will double to £19,000, and will be paid over four months rather than two."
    },
    {
        "Date": "26 August 2023",
        "Event": "Conservative MP Nadine Dorries resigns her Parliamentary seat two months after originally saying she would do so, accusing Prime Minister Rishi Sunak of abandoning \"the fundamental principles of Conservatism\" and that \"history will not judge  kindly\"."
    },
    {
        "Date": "27 August 2023",
        "Event": "Shadow Chancellor Rachel Reeves rules out any form of a wealth tax if Labour wins the next general election, saying that any extra funding for public services must come about as a result of economic growth."
    },
    {
        "Date": "29 August 2023",
        "Event": "The UK government announces plans to scrap EU-era water pollution restrictions on housing development in order to facilitate the building of more houses."
    },
    {
        "Date": "29 August 2023",
        "Event": "Monmouthshire county councillor Sara Burch resigns from her cabinet post following a post on Twitter in which she likened the actions of the Secretary of State for Wales to events in the Romani Holocaust after accusing him of \"whipping up anti-traveller feeling\"."
    },
    {
        "Date": "30 August 2023",
        "Event": "Foreign Secretary James Cleverly meets China's Vice President Han Zheng for talks at the Great Hall of the People in Beijing."
    },
    {
        "Date": "30 August 2023",
        "Event": "Following a number of high profile criminal trials during which convicted defendants have refused to attend their sentencing hearings, Prime Minister Rishi Sunak announces plans to introduce legislation that will compel convicted criminals to attend their sentencing hearings, by force if necessary, or face more time in prison."
    },
    {
        "Date": "30 August 2023",
        "Event": "The UK government announces plans to reinstate EU equal pay laws that were scrapped in a post-Brexit purge of EU legislation."
    },
    {
        "Date": "31 August 2023",
        "Event": "Rishi Sunak carries out a mini-cabinet reshuffle, promoting Grant Shapps to Defence Secretary to replace Ben Wallace who plans to stand down from Parliament at the next election. Claire Coutinho replaces Shapps as Energy Secretary, and at 38, becomes the youngest member of Sunak's cabinet."
    },
    {
        "Date": "31 August 2023",
        "Event": "The Labour Party suspends its entire Leicester East constituency party while the National Executive Committee investigates concerns over its operation."
    },
    {
        "Date": "31 August 2023",
        "Event": "Former Conservative MP Antoinette Sandbach has asked that her name be removed from a 2021 TEDx Talk that connects her to a slave owner, arguing there is no public interest in identifying her as his descendent."
    },
    {
        "Date": "1 September",
        "Event": "Amber de Botton announces her resignation as Downing Street Director of Communications less than a year after her appointment to the role. She is replaced by Nerissa Chesterfield, who is promoted from the post of Downing Street Press Secretary."
    },
    {
        "Date": "3 September",
        "Event": "Chancellor Jeremy Hunt says the UK government will \"spend what it takes\" to put right defective concrete in schools, but concedes that structural problems could be identified in more schools and other public buildings."
    },
    {
        "Date": "3 September",
        "Event": "Neil Gray, Scotland's Wellbeing and Economy Secretary, says there is no immediate risk to schools in Scotland from defective concrete."
    },
    {
        "Date": "4 September",
        "Event": "Opposition leader Sir Keir Starmer performs a shadow cabinet reshuffle, as MPs return to Westminster after the summer break. This includes Angela Rayner becoming both Shadow Levelling Up Secretary and Shadow Deputy Prime Minister."
    },
    {
        "Date": "4 September",
        "Event": "Leader of the Scottish National Party in the House of Commons Stephen Flynn reshuffles his frontbench."
    },
    {
        "Date": "4 September",
        "Event": "Education Secretary Gillian Keegan apologises for her use of offensive language after she is recorded swearing following an appearance on ITV News to discuss the crisis over defective concrete in schools."
    },
    {
        "Date": "4 September",
        "Event": "Former minister Gavin Williamson is told to apologise for sending bullying text messages to a colleague following the publication of the findings of an independent panel of MPs appointed by Parliament to investigate the matter."
    },
    {
        "Date": "4 September",
        "Event": "Christopher Pincher, MP for Tamworth, loses his appeal against an eight week suspension from Parliament over an incident in which he drunkenly groped a colleague."
    },
    {
        "Date": "5 September",
        "Event": "Steve Tuckwell, Sarah Dyke and Keir Mather are sworn in as MPs following the summer break."
    },
    {
        "Date": "5 September",
        "Event": "Former SNP MP Natalie McGarry is ordered to pay £66 for embezzling £25,000 from the SNP and a pro-independence group."
    },
    {
        "Date": "5 September",
        "Event": "First Minister of Scotland Humza Yousaf outlines the programme for government legislation for the year ahead, including improvements to childcare, an extra £1bn for social security and pay improvements for social care staff. There are also plans to ban disposable vapes over environmental concerns."
    },
    {
        "Date": "5 September",
        "Event": "Home Secretary Suella Braverman announces that Russia's mercenary Wagner Group is to be prescribed as a terrorist organisation."
    },
    {
        "Date": "6 September",
        "Event": "Sir Chris Bryant is appointed to the shadow cabinet as Shadow Minister for the Creative and Digital."
    },
    {
        "Date": "6 September",
        "Event": "The Opposition Labour Party unsuccessfully attempts to force a Parliamentary vote that would force the government to publish documents relating to school funding while Sunak was Chancellor."
    },
    {
        "Date": "7 September",
        "Event": "The UK rejoins the EU's Horizon Europe scheme, allowing UK scientists and institutions to apply for money from the £81b fund."
    },
    {
        "Date": "7 September",
        "Event": "Justice Secretary Alex Chalk announces an independent inquiry into the escape of Daniel Khalife from Wandsworth Prison. The inquiry will have two areas of focus a review of the \"placement and categorisation\" of all inmates at Wandsworth, and an investigation of all people in custody currently charged with terror offences."
    },
    {
        "Date": "7 September",
        "Event": "Christopher Pincher resigns his Parliamentary seat, triggering a by-election."
    },
    {
        "Date": "7 September",
        "Event": "Conservative MP Marcus Fysh is reprimanded by the Parliamentary Standards Committee after speaking to the media regarding a now-concluded investigation by the Parliamentary Commissioner, and ordered to apologise to the House of Commons."
    },
    {
        "Date": "8 September",
        "Event": "Prime Minister Rishi Sunak arrives in New Delhi for the G20 summit."
    },
    {
        "Date": "8 September",
        "Event": "A government auction for renewable energy projects ends without any new contracts being awarded for offshore wind farms after developers said they were too expensive. Contracts for onshore wind, solar energy and tidal projects are awarded though."
    },
    {
        "Date": "8 September",
        "Event": "Labour suspends its leadership team in the Bolton North East constituency following a disagreement over who will represent the party at the next general election. An election campaign will be established by an outside convener."
    },
    {
        "Date": "8 September",
        "Event": "The Conservatives defend accepting a £350,000 donation from Sandy Chadha, chief executive of Supreme 8 Limited, who is also chief executive of Supreme PLC, a company accused by the Labour Party of marketing vapes to children."
    },
    {
        "Date": "19 September",
        "Event": "The Scottish Government is scheduled to begin its legal challenge against Westminster over the UK government's decision to block the controversial Gender Recognition Reform (Scotland) Bill."
    },
    {
        "Date": "20 September",
        "Event": "King Charles III and Queen Camilla are scheduled to make a three-day state visit to France, rescheduled from a planned visit in March 2023 which had to be cancelled due to civil unrest."
    },
    {
        "Date": "10 September",
        "Event": "The Sunday Times reports that two men have been arrested under the Official Secrets Act, including a researcher in the UK Parliament accused of spying for China."
    },
    {
        "Date": "10 September",
        "Event": "The Trades Union Congress says that it will report the UK government to the International Labour Organisation over the Strikes (Minimum Service Levels) Act, which will make it mandatory for striking workers to provide a minimum service during industrial action."
    },
    {
        "Date": "5 October 2023",
        "Event": "A Parliamentary by-election is scheduled to take place in Rutherglen and Hamilton West."
    },
    {
        "Date": "19 October 2023",
        "Event": "A Parliamentary by-election is scheduled to take place in Mid Bedfordshire."
    },
    {
        "Date": "7 November 2023",
        "Event": "Charles III attends the 2023 State Opening of Parliament, his first as King and the last to be held before the next general election."
    }
]